app/views/amoebas/_form.html.erb

SELECT "acts".* FROM "acts"
---
    <%= f.label :acts, "Select Acts" %><br>
    <%= f.collection_check_boxes(:act_ids, Act.all, :id, :name) %>