app/views/amoebas/show.html.erb

  <ul>
    <% @amoeba.acts.each do |act| %>
---
SELECT "acts".* FROM "acts" INNER JOIN "amoeba_acts" ON "acts"."id" = "amoeba_acts"."act_id" WHERE "amoeba_acts"."amoeba_id" = ?  [["amoeba_id", 4]]