app/controllers/acts_controller.rb

  def index
    @acts = Act.all
---
SELECT "acts".* FROM "acts"

  def update
    respond_to do |format|
      if @act.update(act_params)
---
UPDATE "acts" SET "time" = ?, "updated_at" = ? WHERE "acts"."id" = 1  [["time", "2000-01-01 18:32:00.000000"], ["updated_at", "2014-07-09 18:49:11.949046"]]

    def set_act
      @act = Act.find(params[:id])
---
SELECT  "acts".* FROM "acts"  WHERE "acts"."id" = ? LIMIT 1  [["id", 1]]