app/controllers/amoebas_controller.rb

SELECT "amoebas".* FROM "amoebas"
---
  def index
    @amoebas = Amoeba.all

INSERT INTO "amoebas" ("created_at", "generation", "name", "talent_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-07-09 17:44:30.573221"], ["generation", 3], ["name", "Stanford"], ["talent_id", 3], ["updated_at", "2014-07-09 17:44:30.573221"]]
---
  def create
    @amoeba = Amoeba.new(amoeba_params)

    respond_to do |format|
      if @amoeba.save

UPDATE "amoebas" SET "name" = ?, "talent_id" = ?, "updated_at" = ? WHERE "amoebas"."id" = 4  [["name", "Tristan"], ["talent_id", 4], ["updated_at", "2014-07-09 15:51:49.359636"]]
---
  def update
    respond_to do |format|
      if @amoeba.update(amoeba_params)

DELETE FROM "amoebas" WHERE "amoebas"."id" = ?  [["id", 4]]
---
  def destroy
    @amoeba.destroy

SELECT  "amoebas".* FROM "amoebas"  WHERE "amoebas"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_amoeba
      @amoeba = Amoeba.find(params[:id])