app/views/acts/_form.html.erb

    <%= f.label :amoebas, "Select Amoeba Performers" %><br>
    <%= f.collection_check_boxes(:amoeba_ids, Amoeba.all, :id, :name) %>
---
SELECT "amoebas".* FROM "amoebas"