app/views/acts/show.html.erb

  <ul>
    <% @act.amoebas.each do |amoeba| %>
---
SELECT "amoebas".* FROM "amoebas" INNER JOIN "amoeba_acts" ON "amoebas"."id" = "amoeba_acts"."amoeba_id" WHERE "amoeba_acts"."act_id" = ?  [["act_id", 1]]